assignments/hw4/hotelapp/wrk2/memcached_singlenode_8000
Running 30s test @ http://127.0.0.1:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 51.438ms, rate sampling interval: 317ms
  Thread calibration: mean lat.: 58.244ms, rate sampling interval: 344ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   133.98ms  127.43ms 439.04ms   75.39%
    Req/Sec     3.96k   454.70     4.59k    89.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   91.20ms
 75.000%  238.59ms
 90.000%  318.72ms
 99.000%  439.04ms
 99.900%  576.00ms
 99.990%  684.03ms
 99.999%  698.37ms
100.000%  701.44ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.309     0.000000            1         1.00
       8.911     0.100000        15819         1.11
      13.391     0.200000        31607         1.25
      20.079     0.300000        47400         1.43
      34.463     0.400000        63193         1.67
      91.199     0.500000        78974         2.00
     131.007     0.550000        86872         2.22
     164.607     0.600000        94773         2.50
     193.535     0.650000       102675         2.86
     215.935     0.700000       110573         3.33
     238.591     0.750000       118457         4.00
     249.855     0.775000       122420         4.44
     261.759     0.800000       126353         5.00
     274.687     0.825000       130370         5.71
     289.023     0.850000       134259         6.67
     303.359     0.875000       138190         8.00
     310.527     0.887500       140195         8.89
     318.719     0.900000       142187        10.00
     327.167     0.912500       144118        11.43
     336.383     0.925000       146090        13.33
     346.879     0.937500       148070        16.00
     352.767     0.943750       149070        17.78
     358.911     0.950000       150047        20.00
     366.335     0.956250       151026        22.86
     374.527     0.962500       152036        26.67
     382.975     0.968750       152999        32.00
     388.351     0.971875       153493        35.56
     393.727     0.975000       153992        40.00
     400.127     0.978125       154489        45.71
     407.039     0.981250       154989        53.33
     415.487     0.984375       155465        64.00
     421.119     0.985938       155714        71.11
     428.287     0.987500       155965        80.00
     434.943     0.989062       156209        91.43
     441.855     0.990625       156454       106.67
     449.791     0.992188       156699       128.00
     454.655     0.992969       156824       142.22
     459.519     0.993750       156947       160.00
     464.895     0.994531       157067       182.86
     471.551     0.995313       157191       213.33
     478.975     0.996094       157314       256.00
     484.607     0.996484       157375       284.44
     489.471     0.996875       157442       320.00
     494.847     0.997266       157499       365.71
     502.271     0.997656       157563       426.67
     515.071     0.998047       157622       512.00
     522.239     0.998242       157654       568.89
     531.967     0.998437       157686       640.00
     542.207     0.998633       157718       731.43
     556.031     0.998828       157746       853.33
     583.167     0.999023       157777      1024.00
     610.303     0.999121       157792      1137.78
     617.983     0.999219       157807      1280.00
     621.567     0.999316       157823      1462.86
     624.127     0.999414       157841      1706.67
     627.199     0.999512       157854      2048.00
     629.247     0.999561       157863      2275.56
     630.271     0.999609       157869      2560.00
     633.855     0.999658       157877      2925.71
     637.439     0.999707       157884      3413.33
     651.263     0.999756       157892      4096.00
     656.895     0.999780       157896      4551.11
     660.479     0.999805       157900      5120.00
     669.183     0.999829       157904      5851.43
     676.351     0.999854       157907      6826.67
     679.935     0.999878       157911      8192.00
     682.495     0.999890       157913      9102.22
     684.031     0.999902       157915     10240.00
     686.079     0.999915       157917     11702.86
     689.151     0.999927       157919     13653.33
     690.175     0.999939       157921     16384.00
     690.687     0.999945       157922     18204.44
     692.223     0.999951       157923     20480.00
     692.735     0.999957       157926     23405.71
     692.735     0.999963       157926     27306.67
     692.735     0.999969       157926     32768.00
     692.735     0.999973       157926     36408.89
     696.319     0.999976       157927     40960.00
     696.319     0.999979       157927     46811.43
     698.367     0.999982       157929     54613.33
     698.367     0.999985       157929     65536.00
     698.367     0.999986       157929     72817.78
     698.367     0.999988       157929     81920.00
     698.367     0.999989       157929     93622.86
     698.367     0.999991       157929    109226.67
     698.367     0.999992       157929    131072.00
     698.367     0.999993       157929    145635.56
     701.439     0.999994       157930    163840.00
     701.439     1.000000       157930          inf
#[Mean    =      133.979, StdDeviation   =      127.427]
#[Max     =      700.928, Total count    =       157930]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  233925 requests in 30.00s, 62.05MB read
Requests/sec:   7798.14
Transfer/sec:      2.07MB